vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_gpio_cmsis.c
static void CMSIS_GPIO_SetOutput(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin, uint32_t val)
{
    GPIO_PinWrite(handle->config->gpio_base, pin, val);
}

static uint32_t CMSIS_GPIO_GetInput(gpio_cmsis_handle_t *handle, ARM_GPIO_Pin_t pin)
{
    return (GPIO_PinRead(handle->config->gpio_base, pin) != 0U);
}

void CMSIS_GPIO_EventIRQ(gpio_cmsis_handle_t *handle)
{
    assert(handle != NULL);

    uint32_t pins;
    uint32_t cb_event = 0U;
    uint32_t pin      = 0U;

#if (defined(FSL_FEATURE_PORT_HAS_NO_INTERRUPT) && FSL_FEATURE_PORT_HAS_NO_INTERRUPT) || \
    (!defined(FSL_FEATURE_SOC_PORT_COUNT))
    gpio_interrupt_config_t event = kGPIO_InterruptStatusFlagDisabled;
    pins = GPIO_GpioGetInterruptFlags(handle->config->gpio_base);

    while(pins >= 1U)
    {
        if((pins & (1U << pin)) != 0U)
        {
            event = (gpio_interrupt_config_t)((handle->config->gpio_base->ICR[pin] & GPIO_ICR_IRQC_MASK) >> GPIO_ICR_IRQC_SHIFT);
            break;
        }
        pin++;
    }

    switch (event)
    {
        case kGPIO_InterruptRisingEdge:
            cb_event = ARM_GPIO_TRIGGER_RISING_EDGE;
            break;
        case kGPIO_InterruptFallingEdge:
            cb_event = ARM_GPIO_TRIGGER_FALLING_EDGE;
            break;
        case kGPIO_InterruptEitherEdge:
            cb_event = ARM_GPIO_TRIGGER_EITHER_EDGE;
            break;
        default:
            assert(false);
            break;
    }

    GPIO_GpioClearInterruptFlags(handle->config->gpio_base, (1U << pin));
#else
    port_interrupt_t event = kPORT_InterruptOrDMADisabled;
    pins = GPIO_PortGetInterruptFlags(handle->config->gpio_base);

    while(pins >= 1U)
    {
        if((pins & (1U << pin)) != 0U)
        {
            event = (port_interrupt_t)((handle->config->port_base->PCR[pin] & PORT_PCR_IRQC_MASK) >> PORT_PCR_IRQC_SHIFT);
            break;
        }
        pin++;
    }

    switch (event)
    {
        case kPORT_InterruptRisingEdge:
            cb_event = ARM_GPIO_TRIGGER_RISING_EDGE;
            break;
        case kPORT_InterruptFallingEdge:
            cb_event = ARM_GPIO_TRIGGER_FALLING_EDGE;
            break;
        case kPORT_InterruptEitherEdge:
            cb_event = ARM_GPIO_TRIGGER_EITHER_EDGE;
            break;
        default:
            assert(false);
            break;
    }

    GPIO_PortClearInterruptFlags(handle->config->gpio_base, (1U << pin));
#endif
    handle->cb_event(pin, cb_event);
}
#endif //(RTE_GPIO_PORT0 && defined(GPIO0)) || (RTE_GPIO_PORT1 && defined(GPIO1))

/******************************* GPIO PORT 0 **********************************************/
#if defined(GPIO0) && defined(RTE_GPIO_PORT0) && RTE_GPIO_PORT0

static const gpio_cmsis_config_t s_gpio_port0_cmsis_config = {
    .gpio_base = GPIO0,
    .port_base = PORT0,
};

static gpio_cmsis_handle_t s_gpio_port0_handle = {
    .config = &s_gpio_port0_cmsis_config,
};

static int32_t GPIO_PORT0_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port0_handle, pin, cb_event);
}

static int32_t GPIO_PORT0_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port0_handle, pin, direction);
}

static int32_t GPIO_PORT0_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port0_handle, pin, mode);
}

static int32_t GPIO_PORT0_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port0_handle, pin, resistor);
}

static int32_t GPIO_PORT0_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO0_IRQ
    EnableIRQ(RTE_GPIO0_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port0_handle, pin, trigger);
}

static uint32_t GPIO_PORT0_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port0_handle, pin);
}

static void GPIO_PORT0_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port0_handle, pin, val);
}

#ifdef RTE_GPIO0_IRQ_HANDLER
void RTE_GPIO0_IRQ_HANDLER(void);
void RTE_GPIO0_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port0_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT0 = {
    .Setup           = GPIO_PORT0_Setup,
    .SetDirection    = GPIO_PORT0_SetDirection,
    .SetOutputMode   = GPIO_PORT0_SetOutputMode,
    .SetPullResistor = GPIO_PORT0_SetPullResistor,
    .SetEventTrigger = GPIO_PORT0_SetEventTrigger,
    .SetOutput       = GPIO_PORT0_SetOutput,
    .GetInput        = GPIO_PORT0_GetInput,
};
#endif

#if defined(GPIO1) && defined(RTE_GPIO_PORT1) && RTE_GPIO_PORT1
static const gpio_cmsis_config_t s_gpio_port1_cmsis_config = {
    .gpio_base = GPIO1,
    .port_base = PORT1,
};

static gpio_cmsis_handle_t s_gpio_port1_handle = {
    .config = &s_gpio_port1_cmsis_config,
};

static int32_t GPIO_PORT1_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port1_handle, pin, cb_event);
}

static int32_t GPIO_PORT1_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port1_handle, pin, direction);
}

static int32_t GPIO_PORT1_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port1_handle, pin, mode);
}

static int32_t GPIO_PORT1_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port1_handle, pin, resistor);
}

static int32_t GPIO_PORT1_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO1_IRQ
    EnableIRQ(RTE_GPIO1_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port1_handle, pin, trigger);
}

static uint32_t GPIO_PORT1_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port1_handle, pin);
}

static void GPIO_PORT1_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port1_handle, pin, val);
}

#ifdef RTE_GPIO1_IRQ_HANDLER
void RTE_GPIO1_IRQ_HANDLER(void);
void RTE_GPIO1_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port1_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT1 = {
    .Setup           = GPIO_PORT1_Setup,
    .SetDirection    = GPIO_PORT1_SetDirection,
    .SetOutputMode   = GPIO_PORT1_SetOutputMode,
    .SetPullResistor = GPIO_PORT1_SetPullResistor,
    .SetEventTrigger = GPIO_PORT1_SetEventTrigger,
    .SetOutput       = GPIO_PORT1_SetOutput,
    .GetInput        = GPIO_PORT1_GetInput,
};

#endif

