vanhao-hub/usb_key_authen/src/core/mcxa156/sdks/frdm_mcxa156_sdk/devices/MCXA156/cmsis_drivers/fsl_gpio_cmsis.c
#if defined(GPIO2) && defined(RTE_GPIO_PORT2) && RTE_GPIO_PORT2

static const gpio_cmsis_config_t s_gpio_port2_cmsis_config = {
    .gpio_base = GPIO2,
    .port_base = PORT2,
};

static gpio_cmsis_handle_t s_gpio_port2_handle = {
    .config = &s_gpio_port2_cmsis_config,
};

static int32_t GPIO_PORT2_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port2_handle, pin, cb_event);
}

static int32_t GPIO_PORT2_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port2_handle, pin, direction);
}

static int32_t GPIO_PORT2_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port2_handle, pin, mode);
}

static int32_t GPIO_PORT2_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port2_handle, pin, resistor);
}

static int32_t GPIO_PORT2_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO2_IRQ
    EnableIRQ(RTE_GPIO2_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port2_handle, pin, trigger);
}

static uint32_t GPIO_PORT2_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port2_handle, pin);
}

static void GPIO_PORT2_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port2_handle, pin, val);
}

#ifdef RTE_GPIO2_IRQ_HANDLER
void RTE_GPIO2_IRQ_HANDLER(void);
void RTE_GPIO2_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port2_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT2 = {
    .Setup           = GPIO_PORT2_Setup,
    .SetDirection    = GPIO_PORT2_SetDirection,
    .SetOutputMode   = GPIO_PORT2_SetOutputMode,
    .SetPullResistor = GPIO_PORT2_SetPullResistor,
    .SetEventTrigger = GPIO_PORT2_SetEventTrigger,
    .SetOutput       = GPIO_PORT2_SetOutput,
    .GetInput        = GPIO_PORT2_GetInput,
};

#endif

#if defined(GPIO3) && defined(RTE_GPIO_PORT3) && RTE_GPIO_PORT3

static const gpio_cmsis_config_t s_gpio_port3_cmsis_config = {
    .gpio_base = GPIO3,
    .port_base = PORT3,
};

static gpio_cmsis_handle_t s_gpio_port3_handle = {
    .config = &s_gpio_port3_cmsis_config,
};

static int32_t GPIO_PORT3_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port3_handle, pin, cb_event);
}

static int32_t GPIO_PORT3_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port3_handle, pin, direction);
}

static int32_t GPIO_PORT3_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port3_handle, pin, mode);
}

static int32_t GPIO_PORT3_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port3_handle, pin, resistor);
}

static int32_t GPIO_PORT3_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO3_IRQ
    EnableIRQ(RTE_GPIO3_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port3_handle, pin, trigger);
}

static uint32_t GPIO_PORT3_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port3_handle, pin);
}

static void GPIO_PORT3_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port3_handle, pin, val);
}

#ifdef RTE_GPIO3_IRQ_HANDLER
void RTE_GPIO3_IRQ_HANDLER(void);
void RTE_GPIO3_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port3_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT3 = {
    .Setup           = GPIO_PORT3_Setup,
    .SetDirection    = GPIO_PORT3_SetDirection,
    .SetOutputMode   = GPIO_PORT3_SetOutputMode,
    .SetPullResistor = GPIO_PORT3_SetPullResistor,
    .SetEventTrigger = GPIO_PORT3_SetEventTrigger,
    .SetOutput       = GPIO_PORT3_SetOutput,
    .GetInput        = GPIO_PORT3_GetInput,
};

#endif

#if defined(GPIO4) && defined(RTE_GPIO_PORT4) && RTE_GPIO_PORT4

static const gpio_cmsis_config_t s_gpio_port4_cmsis_config = {
    .gpio_base = GPIO4,
    .port_base = PORT4,
};

static gpio_cmsis_handle_t s_gpio_port4_handle = {
    .config = &s_gpio_port4_cmsis_config,
};

static int32_t GPIO_PORT4_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port4_handle, pin, cb_event);
}

static int32_t GPIO_PORT4_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port4_handle, pin, direction);
}

static int32_t GPIO_PORT4_SetOutputMode(ARM_GPIO_Pin_t pin, ARM_GPIO_OUTPUT_MODE mode)
{
    return CMSIS_GPIO_SetOutputMode(&s_gpio_port4_handle, pin, mode);
}

static int32_t GPIO_PORT4_SetPullResistor(ARM_GPIO_Pin_t pin, ARM_GPIO_PULL_RESISTOR resistor)
{
    return CMSIS_GPIO_SetPullResistor(&s_gpio_port4_handle, pin, resistor);
}

static int32_t GPIO_PORT4_SetEventTrigger(ARM_GPIO_Pin_t pin, ARM_GPIO_EVENT_TRIGGER trigger)
{
#ifdef RTE_GPIO4_IRQ
    EnableIRQ(RTE_GPIO4_IRQ);
#endif
    return CMSIS_GPIO_SetEventTrigger(&s_gpio_port4_handle, pin, trigger);
}

static uint32_t GPIO_PORT4_GetInput(ARM_GPIO_Pin_t pin)
{
    return CMSIS_GPIO_GetInput(&s_gpio_port4_handle, pin);
}

static void GPIO_PORT4_SetOutput(ARM_GPIO_Pin_t pin, uint32_t val)
{
    CMSIS_GPIO_SetOutput(&s_gpio_port4_handle, pin, val);
}

#ifdef RTE_GPIO4_IRQ_HANDLER
void RTE_GPIO4_IRQ_HANDLER(void);
void RTE_GPIO4_IRQ_HANDLER(void)
{
    s_gpioIsr(&s_gpio_port4_handle);
    SDK_ISR_EXIT_BARRIER;
}
#endif

ARM_DRIVER_GPIO Driver_GPIO_PORT4 = {
    .Setup           = GPIO_PORT4_Setup,
    .SetDirection    = GPIO_PORT4_SetDirection,
    .SetOutputMode   = GPIO_PORT4_SetOutputMode,
    .SetPullResistor = GPIO_PORT4_SetPullResistor,
    .SetEventTrigger = GPIO_PORT4_SetEventTrigger,
    .SetOutput       = GPIO_PORT4_SetOutput,
    .GetInput        = GPIO_PORT4_GetInput,
};
#endif

#if defined(GPIO5) && defined(RTE_GPIO_PORT5) && RTE_GPIO_PORT5

const gpio_cmsis_config_t s_gpio_port5_cmsis_config = {
    .gpio_base = GPIO5,
    .port_base = PORT5,
};

static gpio_cmsis_handle_t s_gpio_port5_handle = {
    .config         = &s_gpio_port5_cmsis_config,
};

static int32_t GPIO_PORT5_Setup(ARM_GPIO_Pin_t pin, ARM_GPIO_SignalEvent_t cb_event)
{
    return CMSIS_GPIO_Setup(&s_gpio_port5_handle, pin, cb_event);
}

static int32_t GPIO_PORT5_SetDirection(ARM_GPIO_Pin_t pin, ARM_GPIO_DIRECTION direction)
{
    return CMSIS_GPIO_SetDirection(&s_gpio_port5_handle, pin, direction);
}

